#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/MOH_APPROVER"]: Refreshing state... [id=moh_applications/client/e6dc2c15-abb0-4a31-83ba-90ccae0e740f/scope-mappings/045f3224-9637-4785-a661-fc6f028804d2/779c5ea7-5c9a-486f-ad8f-4fa2d1d8d365]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/DSR_USER"]: Refreshing state... [id=moh_applications/client/bf1a894f-9665-42b7-96e5-c9ee90bef5fb/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/08f14258-e522-4116-ae91-9cdda9ada3e9]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-MOH-APPROVER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/MOH_APPROVER"]: Refreshing state... [id=moh_applications/client/e6dc2c15-abb0-4a31-83ba-90ccae0e740f/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/a365f662-fbca-4c9a-af4b-076a860933a8]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/DSR_USER"]: Refreshing state... [id=moh_applications/client/bf1a894f-9665-42b7-96e5-c9ee90bef5fb/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/41a5dd49-9708-482b-b789-d79f46e573a0]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRP.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/CONSUMER"]: Refreshing state... [id=7726f28d-0339-4a03-8e52-446125fc4702/d3dc70e8-af0e-4cb9-9e79-3706c94fd8da]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/DSR_USER"]: Refreshing state... [id=moh_applications/client/bf1a894f-9665-42b7-96e5-c9ee90bef5fb/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/c31af1e0-f13b-4505-8b55-c437fdacffb5]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/DSR_USER"]: Refreshing state... [id=moh_applications/client/bf1a894f-9665-42b7-96e5-c9ee90bef5fb/scope-mappings/045f3224-9637-4785-a661-fc6f028804d2/fcb22564-e254-4bb2-8ebf-4596a1ab1330]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/08f14258-e522-4116-ae91-9cdda9ada3e9]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/6c3b9d2b-e51e-4e47-a698-3597ca4e19a2]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/41a5dd49-9708-482b-b789-d79f46e573a0]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/c31af1e0-f13b-4505-8b55-c437fdacffb5]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-DSR-USER.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/DSR_USER"]: Refreshing state... [id=d106947f-49e5-4b46-aa82-ee64ad314736/fcb22564-e254-4bb2-8ebf-4596a1ab1330]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-SECONDARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/SECONDARY_SOURCE"]: Refreshing state... [id=5dd46afb-8767-45b7-979d-3c18a53ba565/dcc3f917-a5aa-46f1-a7f7-3e9ed6e0e5ad]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-SECONDARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/SECONDARY_SOURCE"]: Refreshing state... [id=5dd46afb-8767-45b7-979d-3c18a53ba565/4e6fc50d-7fe8-4538-ac58-7871aea011b8]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-SECONDARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/SECONDARY_SOURCE"]: Refreshing state... [id=5dd46afb-8767-45b7-979d-3c18a53ba565/5438b8e8-4948-4446-a083-531ec9654913]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-SECONDARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/SECONDARY_SOURCE"]: Refreshing state... [id=5dd46afb-8767-45b7-979d-3c18a53ba565/9c02e9eb-e774-4a31-8e43-3e54a54ea88f]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-SECONDARY-SOURCE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/SECONDARY_SOURCE"]: Refreshing state... [id=5dd46afb-8767-45b7-979d-3c18a53ba565/7da1617b-2d92-4c2c-8981-dd7151a76a85]
module.KEYCLOAK_TEST.module.moh_applications.module.MANAGE-USERS.keycloak_role.REALM_ROLE: Refreshing state... [id=b559cd58-395b-4341-b862-d1105aca50c9]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/a94bec86-0808-4f71-a947-b2049afc7d7e]
module.KEYCLOAK_DEV.module.moh_applications.module.MANAGE-USERS.keycloak_role.REALM_ROLE: Refreshing state... [id=8e526714-e19a-4760-b5e8-40efcb2c0b9c]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/9dbc8e8b-0e25-44cd-bd1b-34a1846ac269]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/7f31f194-bfcc-43fd-babe-bc9545292ede]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/2e52bc4c-f321-4bff-98d8-8ce89cd3e2e7/22f2f067-d74a-4108-bf1a-eb6bffd71736]
module.KEYCLOAK_DEV.module.moh_applications.module.DMFT-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=moh_applications/client/2fa5ed3f-39bd-4f67-84be-b1053bec576e/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/493df53a-c656-4a24-a516-5708b51b7101]
module.KEYCLOAK_DEV.module.moh_applications.module.PLR-SHOPPERS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/6f46c738-d23e-4451-988a-7294bc52a402/scope-mappings/dc7b9502-3ffa-4ff8-be2e-ebfebe650590/30f494e9-41c7-40eb-9660-a14bb8248af4]
module.KEYCLOAK_DEV.module.moh_applications.module.DMFT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PIDP-SERVICE/view_endorsement_data"]: Refreshing state... [id=a0553301-93f9-4017-8c3b-fd34d9ab6f0f/493df53a-c656-4a24-a516-5708b51b7101]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-APPLICATION-SUPPORT.keycloak_role.REALM_ROLE: Refreshing state... [id=66800c9e-d995-4f29-9d06-fba5ed7ebd05]
module.KEYCLOAK_PROD.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/e8976c36-6816-4b71-8c2f-3053a8168de7]
module.KEYCLOAK_PROD.module.moh_applications.module.CGI-MID-TIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/303c6348-22b8-4351-abdf-da5b48689724]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-MIDTIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/782fe94e-79a2-438f-9bc1-28717395b28d]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/658f081c-a8b0-4c1b-b9ee-7e8901158ce7]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/ba2aead8-cd2d-4519-991b-3bd44c71c057]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-MID-TIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/4e3d322a-fbe7-438d-8ee7-95a1707d40dc]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DBA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/9ada1d3b-be63-40a3-84f2-e4ec0e10be88]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/1798203d-027f-4856-a445-8a90c1dc9756]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/27967216-03f7-4259-b50a-955b995d51ad]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.EHPR.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "EHPR"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Emergency Health Provider Registry."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "EHPR"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "http://localhost:*",
          + "https://dev.ehpr.freshworks.club/*",
          + "https://localhost:*",
          + "https://test.ehpr.freshworks.club/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.EHPR.keycloak_openid_user_attribute_protocol_mapper.org_details will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "org_details" {
      + add_to_access_token  = true
      + add_to_id_token      = false
      + add_to_userinfo      = false
      + aggregate_attributes = false
      + claim_name           = "org_details"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "org_details"
      + realm_id             = "moh_applications"
      + user_attribute       = "org_details"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*